app/Controllers/Client/AuthController.php

SELECT *
FROM `Compte`
WHERE `numero_telephone` = '0321562072'
 LIMIT 1
---
    public function loginAuto()
    {
        $session = session();
        $clientModel = new ClientModel();
        $compteModel = new CompteModel();
        $operateurModel = new OperateurModel();

        $numero = $this->request->getPost('numero_telephone');

        if (empty($numero)) {
            return redirect()->back()->with('error', 'Veuillez entrer un numéro de téléphone.');
        }

        $compte = $compteModel->where('numero_telephone', $numero)->first();