app/Controllers/Client/OperationController.php

SELECT *
FROM `Compte`
WHERE `Compte`.`id_compte` = 1
---
    private function verifierCompte(int $idCompte): ?array
    {
        if (!session()->get('isLoggedIn')) {
            $this->redirect = redirect()->to('/login');
            return null;
        }

        $compte = $this->compteModel->find($idCompte);
        if (!$compte || $compte['id_client'] != session()->get('client_id')) {

SELECT `Acte`.*, `Operation`.`libelle`, `Acte`.`id_acte` as `numero_transaction`
FROM `Acte`
LEFT JOIN `Operation` ON `Operation`.`id_type_operation` = `Acte`.`id_type_operation`
WHERE   (
`id_compte_source` = '1'
OR `id_compte_destination` = '1'
 )
ORDER BY `date_operation` DESC
---
    public function historique($idCompte)
    {
        $compte = $this->verifierCompte($idCompte);
        if ($compte === null) {
            return $this->redirect;
        }

        $transactions = $this->acteModel
            ->select('Acte.*, Operation.libelle, Acte.id_acte as numero_transaction')
            ->join('Operation', 'Operation.id_type_operation = Acte.id_type_operation', 'left')
            ->groupStart()
            ->where('id_compte_source', $idCompte)
            ->orWhere('id_compte_destination', $idCompte)
            ->groupEnd()
            ->orderBy('date_operation', 'DESC')
            ->findAll();