app/Controllers/Admin/Dashboard.php

    public function index()
    {
        if (!session()->get('admin_logged_in')) {
            return redirect()->to('/admin/login');
        }

        $clientModel = new ClientModel();
        $compteModel = new CompteModel();
        $acteModel = new ActeModel();
        $operationModel = new OperationModel();

        $clients = $clientModel->findAll();
        $comptes = $compteModel->findAll();

        $solde_total = 0;
        foreach ($comptes as $c) {
            $solde_total += $c['solde'];
        }

        $operations = $operationModel->findAll();
        $gains_par_operation = [];
        $total_gains = 0;

        foreach ($operations as $op) {
            $total = $acteModel->selectSum('frais_applique')
                               ->where('id_type_operation', $op['id_type_operation'])
                               ->where('statut', 'Réussi')
                               ->first()['frais_applique'] ?? 0;
---
SELECT *
FROM `Client`
SELECT *
FROM `Compte`
SELECT *
FROM `Operation`
SELECT SUM(`frais_applique`) AS `frais_applique`
FROM `Acte`
WHERE `id_type_operation` = 1
AND `statut` = 'Réussi'
 LIMIT 1


        $clients_avec_comptes = [];
        foreach ($clients as $client) {
            $comptes_client = $compteModel
                ->select('Compte.*, Operateur.nom as operateur_nom, Operateur.prefixe')
                ->join('Operateur', 'Operateur.id_operateur = Compte.id_operateur')
                ->where('id_client', $client['id_client'])
                ->findAll();
---
SELECT `Compte`.*, `Operateur`.`nom` as `operateur_nom`, `Operateur`.`prefixe`
FROM `Compte`
JOIN `Operateur` ON `Operateur`.`id_operateur` = `Compte`.`id_operateur`
WHERE `id_client` = 1

            ];
        }

        $comptes_par_operateur = $compteModel
            ->select('Operateur.nom, Operateur.prefixe, COUNT(Compte.id_compte) as total, SUM(Compte.solde) as solde_total')
            ->join('Operateur', 'Operateur.id_operateur = Compte.id_operateur')
            ->groupBy('Compte.id_operateur')
            ->findAll();
---
SELECT `Operateur`.`nom`, `Operateur`.`prefixe`, COUNT(Compte.id_compte) as total, SUM(Compte.solde) as solde_total
FROM `Compte`
JOIN `Operateur` ON `Operateur`.`id_operateur` = `Compte`.`id_operateur`
GROUP BY `Compte`.`id_operateur`