app/Controllers/Admin/Operation.php

    public function index()
    {
        if (!session()->get('admin_logged_in')) {
            return redirect()->to('/admin/login');
        }

        $operationModel = new OperationModel();
        $tarifModel = new TarifModel();

        $data = [
            'operations' => $operationModel->findAll(),
            'tarifs' => $tarifModel
                        ->select('Tarif.*, Operation.libelle')
                        ->join('Operation', 'Operation.id_type_operation = Tarif.id_type_operation')
                        ->orderBy('id_type_operation')
                        ->orderBy('montant_min')
                        ->findAll()
---
SELECT `Tarif`.*, `Operation`.`libelle`
FROM `Tarif`
JOIN `Operation` ON `Operation`.`id_type_operation` = `Tarif`.`id_type_operation`
ORDER BY `id_type_operation`, `montant_min`