app/Controllers/Admin/Operateur.php

SELECT *
FROM `Operateur`
---
    public function index()
    {
        if (!session()->get('admin_logged_in')) {
            return redirect()->to('/admin/login');
        }

        $model = new OperateurModel();
        return view('admin/operateur', ['operateurs' => $model->findAll()]);

SELECT *
FROM `Operateur`
---
    public function edit($id)
    {
        if (!session()->get('admin_logged_in')) {
            return redirect()->to('/admin/login');
        }

        $model = new OperateurModel();

        $operateur = $model->find($id);

        if (!$operateur) {
            return redirect()->to('/admin/operateur')->with('error', 'Opérateur non trouvé.');
        }

        $operateurs = $model->findAll();