app/Controllers/AuthController.php

SELECT *
FROM `Client`
WHERE `numero_telephone` = '0331562072'
 LIMIT 1
SELECT *
FROM `Compte`
WHERE `id_client` = 1
SELECT *
FROM `Operateur`
WHERE `Operateur`.`id_operateur` = 1
---
    public function loginAuto()
    {
        $session = session();
        $clientModel = new ClientModel();
        $compteModel = new CompteModel();
        $operateurModel = new OperateurModel();

        $numero = $this->request->getPost('numero_telephone');

        if (empty($numero)) {
            return redirect()->back()->with('error', 'Veuillez entrer un numéro de téléphone.');
        }

        $client = $clientModel->where('numero_telephone', $numero)->first();

        if (!$client) {
            return redirect()->back()->with('error', 'Numéro de téléphone non trouvé : ' . $numero);
        }
<<<<<<< HEAD
=======

>>>>>>> dev
        $clientId = $client['id_client'] ?? 'NON TROUVÉ';
        $comptes = $compteModel->where('id_client', $clientId)->findAll();
        if (empty($comptes)) {
            return redirect()->back()->with('error', 'Aucun compte associé à ce client.');
        }


        foreach ($comptes as &$compte) {
            $operateur = $operateurModel->find($compte['id_operateur']);