app/Controllers/OperationController.php

    private function verifierCompte(int $idCompte): ?array
    {
        if (!session()->get('isLoggedIn')) {
            $this->redirect = redirect()->to('/login');
            return null;
        }

        $compte = $this->compteModel->find($idCompte);
---
SELECT *
FROM `Compte`
WHERE `Compte`.`id_compte` = 1

    public function depot($idCompte)
    {
        $compte = $this->verifierCompte($idCompte);
        if ($compte === null) {
            return $this->redirect;
        }

        $montant = (float) $this->request->getPost('montant');

        if ($montant <= 0) {
            return redirect()->back()->with('error', 'Le montant doit être supérieur à 0.');
        }

        $typeDepot = $this->operationModel->where('libelle', 'Dépôt')->first();
        if (!$typeDepot) {
            return redirect()->back()->with('error', 'Type d\'opération « Dépôt » introuvable.');
        }

        $db = $this->compteModel->db;
        $db->transStart();

        $this->compteModel->update($idCompte, [
            'solde' => $compte['solde'] + $montant,
        ]);

        $this->transactionModel->insert([
            'id_compte_source'      => $idCompte,
            'id_compte_destination' => null,
            'id_type_operation'     => $typeDepot['id_type_operation'],
            'montant'               => $montant,
            'frais_applique'        => 0,
            'statut'                => 'Réussi',
        ]);
---
SELECT *
FROM `Operation`
WHERE `libelle` = 'Dépôt'
 LIMIT 1
UPDATE `Compte` SET `solde` = 50200
WHERE `Compte`.`id_compte` IN ('1')
INSERT INTO `Transaction` (`id_compte_source`, `id_compte_destination`, `id_type_operation`, `montant`, `frais_applique`, `statut`) VALUES ('1', NULL, 1, 200, 0, 'Réussi')