app/Models/CommissionModel.php

    public function getAllCommissions()
    {
        return $this->select('Commission.*,
                             OperateurSource.nom as source_nom, OperateurSource.prefixe as source_prefixe,
                             OperateurDest.nom as dest_nom, OperateurDest.prefixe as dest_prefixe')
                    ->join('Operateur as OperateurSource', 'OperateurSource.id_operateur = Commission.id_operateur_source')
                    ->join('Operateur as OperateurDest', 'OperateurDest.id_operateur = Commission.id_operateur_destination')
                    ->findAll();
---
SELECT `Commission`.*, `OperateurSource`.`nom` as `source_nom`, `OperateurSource`.`prefixe` as `source_prefixe`, `OperateurDest`.`nom` as `dest_nom`, `OperateurDest`.`prefixe` as `dest_prefixe`
FROM `Commission`
JOIN `Operateur` as `OperateurSource` ON `OperateurSource`.`id_operateur` = `Commission`.`id_operateur_source`
JOIN `Operateur` as `OperateurDest` ON `OperateurDest`.`id_operateur` = `Commission`.`id_operateur_destination`